# Pandas SQL : With Clause

SQL Common Table Expression (CTE) 

SQL With Caluse

In [1]:
import numpy as np
import pandas as pd
import pandasql as ps

In [2]:
df_id  = pd.DataFrame(data=[x+1 for x in range(15)], columns=['EmpID'] )
df_name= pd.DataFrame(data=["nurur","tom","peter","bo","binbin",
                            "jack","sid","don","rahman",
                            "nick","adam","ross",
                            "kyle","sohel",
                            "robin"], columns=['EmpName'])
df_manager = pd.DataFrame(data=["xxxx","nurur","nurur","peter","peter",
                                "don","don","nurur","yyyy",
                                "ross","ross","ross",
                                "zzz","kyle",
                                "carole"], columns=['EmpManager'])

In [3]:
df_dept = pd.DataFrame(data=["AA","AA","AA","AA","AA","IT","IT",
                             "IT","IT","SALE","SALE","SALE","HR",
                             "HR","BD"], columns=['EmpDept'])

In [4]:
df_salary = pd.DataFrame(data=[41000,29000,33000,21000,21000,
                             33000,29000,24000,26500,
                             51000,51000,43000,19000,13700,
                             39000], columns=['EmpSalary'])

In [5]:
df = pd.concat([df_id,df_name,df_manager,df_dept,df_salary], axis=1)

In [6]:
a = df.sort_values("EmpSalary", ascending=False).head(2)
print(a)

    EmpID EmpName EmpManager EmpDept  EmpSalary
9      10    nick       ross    SALE      51000
10     11    adam       ross    SALE      51000

In [7]:
a = ps.sqldf("""SELECT * FROM df ORDER BY EmpSalary DESC LIMIT 2""")
print(a)

   EmpID EmpName EmpManager EmpDept  EmpSalary
0     10    nick       ross    SALE      51000
1     11    adam       ross    SALE      51000

#### with clause

In [8]:
q = """
    WITH fmax AS
    (SELECT EmpID,EmpName,EmpDept,EmpSalary
    FROM df 
    GROUP BY EmpDept
    ORDER BY EmpSalary DESC),
    fmin AS
    (SELECT EmpID,EmpName,EmpDept,AVG(EmpSalary) as AvgSalary
    FROM df 
    GROUP BY EmpDept)  
    SELECT fmax.EmpID, fmax.EmpName, fmin.EmpName, fmax.EmpSalary, fmin.AvgSalary 
    FROM fmax, fmin
    WHERE fmax.EmpDept=fmin.EmpDept
    """
a = ps.sqldf(q)
print(a)

   EmpID EmpName EmpName  EmpSalary     AvgSalary
0     10    nick    nick      51000  48333.333333
1      1   nurur   nurur      41000  29000.000000
2     15   robin   robin      39000  39000.000000
3      6    jack    jack      33000  28125.000000
4     13    kyle    kyle      19000  16350.000000